# StructuralFamilyNameKey Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralFamilyNameKey Property
ParameterTypeId Class See Also
---
"Family Name Key"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralFamilyNameKey { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralFamilyNameKey As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralFamilyNameKey {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace